"use client";
import { useState, useEffect } from "react";
import { get, ref } from "firebase/database";
import { database } from "@/lib/firebase";
import BiodataCard from "./biodata_card";
import Loading from "../loading";
import BoyOrGirlLink from "./BoyOrGirlLink";

const DataComponent = () => {
  const [data, setData] = useState(null);

  useEffect(() => {
    const usersRef = ref(database, "ApprovedBiodata");
    get(usersRef)
      .then((snapshot) => {
        if (snapshot.exists()) {
          const snapData = Object.entries(snapshot.val());
          setData(snapData.reverse());
        } else {
          alert("Somthing wrong! No data found!!");
        }
      })
      .catch((error) => console.log(error));
  }, []);

  return (
    <div>
      {data ? (
        <div>
          <div className="w-full text-center">
            <h1 className="px-2 py-4 text-4xl sm:text-5xl text-purple-800 underline underline-offset-8 decoration-double decoration-purple-800 font-bold mt-6 animatedText galada-regular">
              “সমস্ত বায়োডাটা”
            </h1>
            <p className="text-pink-700 px-4 md:text-xl">
              আপনার কোনো বায়োডাটা পছন্দ হলে যোগাযোগের তথ্য পেতে “বায়োডাটা ID”
              নিয়ে আমাদের ফেসবুক পেইজে মেসেজ দিন।
            </p>
          </div>
          {/*  */}
          <BoyOrGirlLink />

          <div>
            <div className="grid justify-center items-center grid-cols-1 md:grid-cols-2 lg:grid-cols-3 xl:grid-cols-4 gap-1   mt-3">
              {data.map((singleData) => (
                <div
                  key={singleData[0]}
                  className="h-max rounded-xl m-2  text-white p-3"
                >
                  <BiodataCard
                    dataName={singleData[0]}
                    dataObj={singleData[1]}
                  />
                </div>
              ))}
            </div>
          </div>
        </div>
      ) : (
        <>
          <Loading />
          <p>
            🕌 বিয়ে সম্পর্কিত গুরুত্বপূর্ণ হাদিস বিয়ে সুন্নত রাসূল (সা.) বলেন:
            “বিয়ে আমার সুন্নত। আর যে আমার সুন্নত থেকে বিমুখ হলো, সে আমার উম্মত
            নয়।” 📚 (বুখারি: 5063, মুসলিম: 1401) বিয়ে যৌবন রক্ষার মাধ্যম রাসূল
            (সা.) বলেন: “হে যুব সমাজ! তোমাদের মধ্যে যারা বিয়ের সামর্থ্য রাখে,
            তারা যেন বিয়ে করে। কারণ এটি দৃষ্টি অবনমিত রাখে এবং যৌন অঙ্গকে সংযত
            রাখে।” 📚 (বুখারি: 5066, মুসলিম: 1400) ধর্ম দেখে বিয়ে করা রাসূল
            (সা.) বলেন: “নারীকে বিয়ে করা হয় চারটি কারণে—তাঁর ধন-সম্পদ,
            বংশ-মর্যাদা, সৌন্দর্য ও ধর্মীয়তা। তবে তুমি ধর্মবতী নারীকে বেছে নাও,
            তাহলে তুমি কল্যাণ লাভ করবে।” 📚 (বুখারি: 5090, মুসলিম: 1466) বিয়ের
            মাধ্যমে ঈমান পূর্ণ হয় রাসূল (সা.) বলেন: “যে ব্যক্তি বিয়ে করলো, সে
            যেন তার অর্ধেক দ্বীন পূর্ণ করলো। অতএব, সে যেন বাকি অর্ধেকের ব্যাপারে
            আল্লাহকে ভয় করে।” 📚 (আল-বায়হাকি, হাদিস সহিহ) বিয়ে করা ইবাদত রাসূল
            (সা.) বলেন: “তোমাদের মধ্যে যার নিকাহ হবার সামর্থ্য আছে, সে যেন নিকাহ
            করে; এটি দৃষ্টি সংযত রাখে ও লজ্জাস্থান হেফাজত করে।” 📚 (বুখারি ও
            মুসলিম) আল্লাহ রিজিক বৃদ্ধি করেন আল্লাহ বলেন: “তোমাদের মধ্যে যারা
            বিবাহযোগ্য, তাদের বিয়ে দাও... তারা যদি দরিদ্র হয়, তবে আল্লাহ নিজ
            অনুগ্রহে তাদের অভাবমুক্ত করবেন।” 📖 (সূরা আন-নূর: ৩২) বিয়ের মাধ্যমে
            রহমত আসে রাসূল (সা.) বলেন: “তিন ব্যক্তির সাহায্য করা আল্লাহর
            দায়িত্ব: ১) যে ব্যক্তি আল্লাহর সন্তুষ্টির জন্য বিয়ে করে…” 📚
            (তিরমিজি: 1655, সহিহ) সন্তান জন্মানো পছন্দনীয় রাসূল (সা.) বলেন:
            “তোমরা সেই নারীকে বিয়ে করো, যে অধিক সন্তান জন্ম দিতে পারে এবং
            স্নেহশীলা। কারণ আমি কিয়ামতের দিন তোমাদের সংখ্যার ওপর গর্ব করব।” 📚
            (আবু দাউদ: 2050) বিয়ে হচ্ছে পবিত্রতা রক্ষার মাধ্যম রাসূল (সা.) বলেন:
            “বিয়ে হচ্ছে পবিত্রতা অর্জনের অর্ধেক।” 📚 (সহিহ ইবনে হিব্বান: 4032)
            তরুণদের জন্য বিয়ে উত্তম নিয়ন্ত্রণ রাসূল (সা.) বলেন: “যে ব্যক্তি
            বিয়ের সামর্থ্য না রাখে, সে যেন রোজা রাখে। কেননা এটি তার যৌন চাহিদা
            নিয়ন্ত্রণে সহায়তা করবে।” 📚 (বুখারি: 5066) সৎ স্ত্রী হলো সর্বোত্তম
            নিয়ামত মুমিন ব্যক্তি আল্লাহভীরু হওয়ার পর উত্তম কোনো কিছু লাভ করেনি,
            স্ত্রীর চেয়ে উত্তম কিছু নয়। ইবনে মাজাহ: 1855 স্ত্রীর প্রতি
            সদ্ব্যবহার নারীর প্রতি তোমরা সদ্ব্যবহার করবে। কারণ তারা তোমাদের
            গৃহের সঙ্গিনী। মুসলিম: 1468 স্ত্রীর সঙ্গে উত্তম আচরণ তোমাদের মধ্যে
            শ্রেষ্ঠ সেই ব্যক্তি, যে নিজের স্ত্রীর সঙ্গে উত্তম আচরণ করে। তিরমিজি:
            3895 বিয়ে দ্বীনের অর্ধেক যখন কোনো ব্যক্তি বিয়ে করে, তখন সে তার দ্বীন
            পূর্ণ করে; সে যেন বাকি অর্ধেক বিষয়ে আল্লাহকে ভয় করে। আল বাইহাকি,
            সহিহ সন্তান উৎপাদনে সক্ষম নারীকে বিয়ে তোমরা এমন নারীদের বিয়ে করো,
            যারা দীনদার ও সন্তান উৎপাদনে সক্ষম, আমি কিয়ামতের দিন তোমাদের সংখ্যার
            ওপর গর্ব করব। আবু দাউদ: 2050 বিয়ে বিলম্ব না করা তিনটি জিনিস রয়েছে,
            যা দেরি না করে করা উচিত: নামাজ, জানাজা এবং যখন উপযুক্ত পাত্র-পাত্রীর
            মিলন ঘটে বিয়ে। তিরমিজি: 171 সৎ স্ত্রী দুনিয়ার শ্রেষ্ঠ সম্পদ দুনিয়াটা
            হলো এক ধরণের ভোগ্য বস্তু, আর এর মধ্যে সর্বোত্তম ভোগ্য বস্তু হলো সৎ
            নারী। মুসলিম: 1467 স্ত্রীকে সম্মান করা স্ত্রী হলো স্বামীর
            অর্ধাঙ্গিনী, সে যেন তার স্ত্রীকে সম্মান করে ও ভালবাসে। তিরমিজি: 1162
            (অর্থবোধে বর্ণিত) স্ত্রীর গুণাবলি খেয়াল করা এক মুমিন ব্যক্তির জন্য
            তার স্ত্রীকে ঘৃণা করা উচিত নয়। যদি তার কোনো একটি গুণ অপছন্দ হয়, তবে
            অন্য গুণে সন্তুষ্ট হোক। মুসলিম: 1469 অভাবীদের বিয়েতে সাহায্য তোমরা
            ইয়াতিম, গরিব ও অভাবীদের বিয়েতে সাহায্য করো। এতে আল্লাহ তোমাদের ওপর
            রহমত বর্ষণ করবেন। ইবনে মাজাহ: 1847 (অর্থবোধে)
          </p>
        </>
      )}
    </div>
  );
};

export default DataComponent;
